# Pandas Cheatsheet

In [ ]:
# Reference: https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_sql.html

In [88]:
import pandas as pd
import numpy as np

### Dataframe creation

In [89]:
df = pd.DataFrame({
    'name': ['Alex', 'Rony', 'Kallis', 'Ibrahim', 'James', 'Kyle', 'Patric'],
    'country': ['AU', 'US', 'US', 'UK', 'RSA', 'NED', np.nan],
    'age': [40, 33, 26, 58, 88, 21, np.nan]
})
df.head(10)

      name country   age
0     Alex      AU  40.0
1     Rony      US  33.0
2   Kallis      US  26.0
3  Ibrahim      UK  58.0
4    James     RSA  88.0
5     Kyle     NED  21.0
6   Patric     NaN   NaN

### SELECT Operation

In [90]:
df[['name', 'age']].head(10)

      name   age
0     Alex  40.0
1     Rony  33.0
2   Kallis  26.0
3  Ibrahim  58.0
4    James  88.0
5     Kyle  21.0
6   Patric   NaN

### WHERE Clause

In [91]:
df[df['age'] > 50].head(10)

      name country   age
3  Ibrahim      UK  58.0
4    James     RSA  88.0

In [92]:
# OR operation
df[(df['age'] > 50) | (df['country'] == 'US')].head(10)

      name country   age
1     Rony      US  33.0
2   Kallis      US  26.0
3  Ibrahim      UK  58.0
4    James     RSA  88.0

In [93]:
# AND operation
df[(df['age'] > 50) & (df['country'] == 'UK')].head(10)

      name country   age
3  Ibrahim      UK  58.0

In [94]:
# NULL check
df[df['age'].isna()].head(10)

     name country  age
6  Patric     NaN  NaN

In [95]:
# NOT NULL check
df[df['age'].notna()].head(10)

      name country   age
0     Alex      AU  40.0
1     Rony      US  33.0
2   Kallis      US  26.0
3  Ibrahim      UK  58.0
4    James     RSA  88.0
5     Kyle     NED  21.0

### GROUP BY

In [96]:
# aggregate operations: min, max, sum, count, nunique, mean
grp = df.groupby(['country'], as_index=False).agg({'age': 'min', 'name': 'nunique'}).head(10)
alias_grp = grp.rename(columns={'country': 'country', 'age': 'min_age', 'name': 'unique_users'})
alias_grp.head(10)

  country  min_age  unique_users
0      AU     40.0             1
1     NED     21.0             1
2     RSA     88.0             1
3      UK     58.0             1
4      US     26.0             2

### JOIN

In [97]:
df1 = pd.DataFrame({
    "key": ['A', 'B', 'C', 'D'],
    "value": np.random.rand(4)
})

df2 = pd.DataFrame({
    "key": ['B', 'D', 'D', 'E'],
    "value": np.random.rand(4)
})

# Inner join
df_inner = df1.merge(df2, on=['key'], how='inner')
print('Inner join')
print(df_inner.head(10))

# Left join
df_left = df1.merge(df2, on=['key'], how='left')
print('Left join')
print(df_left.head(10))

# Right join
df_right = df1.merge(df2, on=['key'], how='right')
print('Right join')
print(df_right.head(10))

# Outer join
df_outer = df1.merge(df2, on=['key'], how='outer')
print('Outer join')
print(df_outer.head(10))

Inner join
  key   value_x   value_y
0   B  0.834660  0.495035
1   D  0.625828  0.066768
2   D  0.625828  0.209530
Left join
  key   value_x   value_y
0   A  0.227638       NaN
1   B  0.834660  0.495035
2   C  0.020245       NaN
3   D  0.625828  0.066768
4   D  0.625828  0.209530
Right join
  key   value_x   value_y
0   B  0.834660  0.495035
1   D  0.625828  0.066768
2   D  0.625828  0.209530
3   E       NaN  0.990133
Outer join
  key   value_x   value_y
0   A  0.227638       NaN
1   B  0.834660  0.495035
2   C  0.020245       NaN
3   D  0.625828  0.066768
4   D  0.625828  0.209530
5   E       NaN  0.990133

In [98]:
df1 = pd.DataFrame({
    "key_a": ['A', 'B', 'C', 'D'],
    "value": np.random.rand(4)
})

df2 = pd.DataFrame({
    "key_b": ['B', 'D', 'D', 'E'],
    "value": np.random.rand(4)
})

df_join = df1.merge(df2, left_on=['key_a'], right_on=['key_b'], how='inner')[['key_a', 'value_x', 'value_y']].rename(columns={'key_a': 'key'})
df_join.head(10)

  key   value_x   value_y
0   B  0.746313  0.469535
1   D  0.232195  0.276993
2   D  0.232195  0.106464